app/Controllers/Proyectos.php

    public function detalles($projectId)
    {
        $session = session();
        if (!$session->get('is_logged_in')) {
            return redirect()->to('/login');
        }

        $defaults = ['default_theme' => 'dark'];
        $settings = $session->get('general_settings') ?? $defaults;
        helper('url');

        $db = Database::connect();

        // --- 1. DATOS PRINCIPALES DEL PROYECTO (Sin cambios) ---
        $proyectoInfo = $db->table('dbo.proyectos p')
            ->select('p.id_proyecto, p.nombre, p.descripcion, p.status, p.fecha_inicio, p.fecha_fin, u.Nombre, u.Apellido_Paterno')
            ->join('dbo.usuario u', 'u.Id_usuario = p.id_usuario_asignado', 'left')
            ->where('p.id_proyecto', $projectId)
            ->get()
            ->getRowArray();

        if (!$proyectoInfo) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // --- 2. ESTADÍSTICAS (Sin cambios) ---
        $total_tareas = $db->table('dbo.TAREAS')->where('PROY_ID', $projectId)->countAllResults();
        $tareas_completadas = $db->table('dbo.TAREAS t')->join('dbo.ESTATUS e', 't.STAT_ID = e.STAT_ID')->where('t.PROY_ID', $projectId)->where('e.STAT_NOM', 'Completado')->countAllResults();
---
SELECT "p"."id_proyecto", "p"."nombre", "p"."descripcion", "p"."status", "p"."fecha_inicio", "p"."fecha_fin", "u"."Nombre", "u"."Apellido_Paterno"
FROM "pruebas"."dbo"."proyectos" "p"
LEFT JOIN "pruebas"."dbo"."usuario" "u" ON "u"."Id_usuario" = "p"."id_usuario_asignado"
WHERE "p"."id_proyecto" = '2'
SELECT COUNT(*) AS "numrows"
FROM "pruebas"."dbo"."TAREAS"
WHERE "PROY_ID" = '1'
SELECT COUNT(*) AS "numrows"
FROM "pruebas"."dbo"."TAREAS" "t"
JOIN "pruebas"."dbo"."ESTATUS" "e" ON "t"."STAT_ID" = "e"."STAT_ID"
WHERE "t"."PROY_ID" = '1'
AND "e"."STAT_NOM" = 'Completado'